target/surefire-reports/src.test.java.com.wellsfargo.featurefiles.karate05_soap_validation.html

<!DOCTYPE html>
<html lang="en">
  
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    
<meta charset="utf-8">
    
<meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport">
    
<link href="res/bootstrap.min.css" rel="stylesheet" type="text/css">
    
<link href="res/karate-report.css" rel="stylesheet" type="text/css">
    
<link href="favicon.ico" rel="shortcut icon">
    
<script src="res/jquery.min.js" type="text/javascript"></script>
    <script src="res/jquery.tablesorter.min.js" type="text/javascript"></script>
    <script src="res/bootstrap.min.js" type="text/javascript"></script>
    <script src="res/karate-report.js" type="text/javascript"></script>
    
<title>src.test.java.com.wellsfargo.featurefiles.karate05_soap_validation</title>
  
</head>
  
<body>
    
<div id="root-container">
      
<div id="leftnav">
        
<div class="nav-logo">
          
<a href="karate-summary.html">
            <img alt="Karate" src="res/karate-logo.svg">
          </a>
          
<div class="nav-count">
            
<div class="bg-success" id="nav-pass">2</div>
            
<div class="bg-danger" id="nav-fail">0</div>
          
</div>
        
</div>
        
<div id="nav-type">Scenarios</div>         
        
<div id="nav-date">2021-06-01 03:05:31 PM</div>        
      
<div class="nav-container">
<div class="nav-item passed">
<a href="#[1:5]">[1:5] soap validation 1.1 testcase1 this is the first soap complete testcase of soap</a>
</div>
<div class="nav-item passed">
<a href="#[2:35]">[2:35] soap validation 1.2 testcase1 this is the second soap complete testcase of soap</a>
</div>
</div>
</div>
      
<div id="content">
      
<div class="page-heading alert alert-primary">
<a href="karate-summary.html">Summary</a><span class="feature-label">|</span><a href="karate-tags.html">Tags</a><span class="feature-label">|</span><span class="feature-label">Feature:</span><span class="feature-name">src/test/java/com/wellsfargo/featurefiles/karate05_soap_validation.feature</span><span class="feature-description">Karate Test Suite 5 | soap api complete validation</span>
</div>
<div class="scenario">
<div class="scenario-heading" id="[1:5]">
<div class="heading-container">
<div class="scenario-tags">
<a class="badge badge-primary" href="karate-tags.html">soap</a>
</div>
<span class="scenario-keyword">Scenario: [1:5]</span><span class="scenario-name">soap validation 1.1 testcase1 this is the first soap complete testcase of soap</span>
</div>
<div class="scenario-time passed">ms: 2422</div>
</div>
<div class="step-row">
<div class="step-container" id="1">
<div class="step-ref passed">1</div>
<div class="step-cell passed">Given url "https://www.w3schools.com/xml/tempconvert.asmx"</div>
</div>
<div class="time-cell passed">9</div>
</div>
<div class="preformatted" data-parent="1">15:05:28.255 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row">
<div class="step-container" id="2">
<div class="step-ref passed">2</div>
<div class="step-cell passed">And header Content-Type = "text/xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="3">
<div class="step-ref passed">3</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">8</div>
</div>
<div class="preformatted" data-parent="3">&lt;?xml version="1.0" encoding="utf-8"?&gt;
  &lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
     &lt;soap:Body&gt;
         &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;
         &lt;Celsius&gt;37&lt;/Celsius&gt;
         &lt;/CelsiusToFahrenheit&gt;
     &lt;/soap:Body&gt;
   &lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="4">
<div class="step-ref passed">4</div>
<div class="step-cell passed">When soap action "https://www.w3schools.com/xml/CelsiusToFahrenheit"</div>
</div>
<div class="time-cell passed">2114</div>
</div>
<div class="preformatted" data-parent="4">15:05:29.583 request:
1 &gt; POST https://www.w3schools.com/xml/tempconvert.asmx
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 363
1 &gt; Content-Type: text/xml; charset=UTF-8
1 &gt; Host: www.w3schools.com
1 &gt; SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
     &lt;soap:Body&gt;&#13;
         &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;&#13;
         &lt;Celsius&gt;37&lt;/Celsius&gt;&#13;
         &lt;/CelsiusToFahrenheit&gt;&#13;
     &lt;/soap:Body&gt;&#13;
   &lt;/soap:Envelope&gt;

15:05:30.427 response time in milliseconds: 826.64
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0,public
1 &lt; Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; Content-Type: text/xml; charset=utf-8
1 &lt; Date: Tue, 01 Jun 2021 09:22:58 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; Vary: Accept-Encoding
1 &lt; X-AspNet-Version: 4.0.30319
1 &lt; X-Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&lt;/CelsiusToFahrenheitResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="5">
<div class="step-ref passed">5</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="6">
<div class="step-ref passed">6</div>
<div class="step-cell passed">* print responseHeaders</div>
</div>
<div class="time-cell passed">202</div>
</div>
<div class="preformatted" data-parent="6">15:05:30.630 [print] {
  "Cache-Control": [
    "private, max-age=0,public"
  ],
  "Content-Security-Policy": [
    "frame-ancestors 'self' https://mycourses.w3schools.com;"
  ],
  "Content-Type": [
    "text/xml; charset=utf-8"
  ],
  "Date": [
    "Tue, 01 Jun 2021 09:22:58 GMT"
  ],
  "Server": [
    "Microsoft-IIS/7.5"
  ],
  "Vary": [
    "Accept-Encoding"
  ],
  "X-AspNet-Version": [
    "4.0.30319"
  ],
  "X-Content-Security-Policy": [
    "frame-ancestors 'self' https://mycourses.w3schools.com;"
  ],
  "X-Powered-By": [
    "ASP.NET"
  ]
}</div>
<div class="step-row">
<div class="step-container" id="7">
<div class="step-ref passed">7</div>
<div class="step-cell passed">* match responseHeaders["Server"] == ["Microsoft-IIS/7.5"]</div>
</div>
<div class="time-cell passed">17</div>
</div>
<div class="step-row">
<div class="step-container" id="8">
<div class="step-ref passed">8</div>
<div class="step-cell passed">* match responseHeaders["Server"][0] == "Microsoft-IIS/7.5"</div>
</div>
<div class="time-cell passed">10</div>
</div>
<div class="step-row">
<div class="step-container" id="9">
<div class="step-ref passed">9</div>
<div class="step-cell passed">* match responseType == "xml"</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="10">
<div class="step-ref passed">10</div>
<div class="step-cell passed">* print response</div>
</div>
<div class="time-cell passed">3</div>
</div>
<div class="preformatted" data-parent="10">15:05:30.661 [print] &lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&#13;
      &lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&#13;
    &lt;/CelsiusToFahrenheitResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="11">
<div class="step-ref passed">11</div>
<div class="step-cell passed">* match response contains "98"</div>
</div>
<div class="time-cell passed">13</div>
</div>
<div class="step-row">
<div class="step-container" id="12">
<div class="step-ref passed">12</div>
<div class="step-cell passed">* match response //CelsiusToFahrenheitResult == 98.6</div>
</div>
<div class="time-cell passed">12</div>
</div>
<div class="step-row">
<div class="step-container" id="13">
<div class="step-ref passed">13</div>
<div class="step-cell passed">* assert responseTime &lt;= 2000</div>
</div>
<div class="time-cell passed">22</div>
</div>
<div class="step-row">
<div class="step-container" id="14">
<div class="step-ref passed">14</div>
<div class="step-cell passed">* print responseTime</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="preformatted" data-parent="14">15:05:30.724 [print] 827</div>
</div>
<div class="scenario">
<div class="scenario-heading" id="[2:35]">
<div class="heading-container">
<div class="scenario-tags">
<a class="badge badge-primary" href="karate-tags.html">soap</a>
</div>
<span class="scenario-keyword">Scenario: [2:35]</span><span class="scenario-name">soap validation 1.2 testcase1 this is the second soap complete testcase of soap</span>
</div>
<div class="scenario-time passed">ms: 395</div>
</div>
<div class="step-row">
<div class="step-container" id="15">
<div class="step-ref passed">15</div>
<div class="step-cell passed">Given url "https://www.w3schools.com/xml/tempconvert.asmx"</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="preformatted" data-parent="15">15:05:30.740 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row">
<div class="step-container" id="16">
<div class="step-ref passed">16</div>
<div class="step-cell passed">And header Content-Type = "application/soap+xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">11</div>
</div>
<div class="step-row">
<div class="step-container" id="17">
<div class="step-ref passed">17</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">4</div>
</div>
<div class="preformatted" data-parent="17">&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"&gt;
  &lt;soap12:Body&gt;
&lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;
  &lt;Celsius&gt;40&lt;/Celsius&gt;
&lt;/CelsiusToFahrenheit&gt;
  &lt;/soap12:Body&gt;
&lt;/soap12:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="18">
<div class="step-ref passed">18</div>
<div class="step-cell passed">When method post</div>
</div>
<div class="time-cell passed">355</div>
</div>
<div class="preformatted" data-parent="18">15:05:30.771 request:
1 &gt; POST https://www.w3schools.com/xml/tempconvert.asmx
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 337
1 &gt; Content-Type: application/soap+xml; charset=UTF-8
1 &gt; Host: www.w3schools.com
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
&lt;soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap12:Body&gt;&#13;
&lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;&#13;
  &lt;Celsius&gt;40&lt;/Celsius&gt;&#13;
&lt;/CelsiusToFahrenheit&gt;&#13;
  &lt;/soap12:Body&gt;&#13;
&lt;/soap12:Envelope&gt;

15:05:31.099 response time in milliseconds: 337.15
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0,public
1 &lt; Content-Length: 400
1 &lt; Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; Content-Type: application/soap+xml; charset=utf-8
1 &lt; Date: Tue, 01 Jun 2021 09:22:59 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; X-AspNet-Version: 4.0.30319
1 &lt; X-Content-Security-Policy: frame-ancestors 'self' https://mycourses.w3schools.com;
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&lt;CelsiusToFahrenheitResult&gt;104&lt;/CelsiusToFahrenheitResult&gt;&lt;/CelsiusToFahrenheitResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="19">
<div class="step-ref passed">19</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="20">
<div class="step-ref passed">20</div>
<div class="step-cell passed">* print responseHeaders</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="20">15:05:31.115 [print] {
  "Cache-Control": [
    "private, max-age=0,public"
  ],
  "Content-Security-Policy": [
    "frame-ancestors 'self' https://mycourses.w3schools.com;"
  ],
  "Content-Type": [
    "application/soap+xml; charset=utf-8"
  ],
  "Date": [
    "Tue, 01 Jun 2021 09:22:59 GMT"
  ],
  "Server": [
    "Microsoft-IIS/7.5"
  ],
  "X-AspNet-Version": [
    "4.0.30319"
  ],
  "X-Content-Security-Policy": [
    "frame-ancestors 'self' https://mycourses.w3schools.com;"
  ],
  "X-Powered-By": [
    "ASP.NET"
  ],
  "Content-Length": [
    "400"
  ]
}</div>
<div class="step-row">
<div class="step-container" id="21">
<div class="step-ref passed">21</div>
<div class="step-cell passed">* match responseHeaders["Content-Type"] == ["application/soap+xml; charset=utf-8"]</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="step-row">
<div class="step-container" id="22">
<div class="step-ref passed">22</div>
<div class="step-cell passed">* match responseHeaders["Content-Type"][0] == "application/soap+xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="step-row">
<div class="step-container" id="23">
<div class="step-ref passed">23</div>
<div class="step-cell passed">* match responseType == "xml"</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="24">
<div class="step-ref passed">24</div>
<div class="step-cell passed">* print response</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="24">15:05:31.115 [print] &lt;soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&#13;
      &lt;CelsiusToFahrenheitResult&gt;104&lt;/CelsiusToFahrenheitResult&gt;&#13;
    &lt;/CelsiusToFahrenheitResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="25">
<div class="step-ref passed">25</div>
<div class="step-cell passed">* match response contains "104"</div>
</div>
<div class="time-cell passed">9</div>
</div>
<div class="step-row">
<div class="step-container" id="26">
<div class="step-ref passed">26</div>
<div class="step-cell passed">* match response //CelsiusToFahrenheitResult == 104</div>
</div>
<div class="time-cell passed">8</div>
</div>
<div class="step-row">
<div class="step-container" id="27">
<div class="step-ref passed">27</div>
<div class="step-cell passed">* assert responseTime &lt;= 2000</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="step-row">
<div class="step-container" id="28">
<div class="step-ref passed">28</div>
<div class="step-cell passed">* print responseTime</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="preformatted" data-parent="28">15:05:31.146 [print] 337</div>
</div>
</div>
    
</div>   
  
</body>

</html>
